import Script from "next/script";

export const viewport = {
  width: "device-width",
  initialScale: 1,
};

// export const metadata = {
//   metadataBase: new URL(`${baseUrl}`),
//   title: {
//     default: "آرتاک | آموزش اصولی زبان انگلیسی با ویدیو",
//     template: "%s | آرتاک",
//   },
//   description:
//     "اپلیکیشن و وب اپلیکیشن اندروید و آیفون آموزش مکالمه زبان انگلیسی با فیلم و سریال از پایه تا پیشرفته بهمراه ترجمه کلمات و تشریح گرامر با زیرنویس انگلیسی و فارسی همزبان",
//   keywords: [
//     "آموزش زبان انگلیسی با فیلم و سریال",
//     "آموزش زبان انگلیسی با انگلیش تودی",
//     "آموزش زبان انگلیسی با English Today",
//     "آموزش زبان انگلیسی با سریال فرندز",
//     "آموزش زبان انگلیسی با سریال Friends series",
//     "آموزش زبان انگلیسی با سریال بیگ بنگ تئوری",
//     "آموزش زبان انگلیسی با سریال Big bang theory series",
//     "اپلیکیشن و وب اپلیکیشن اندروید و آیفون آموزش مکالمه زبان انگلیسی با زیرنویس انگلیسی و فارسی همزمان",
//     "ترجمه کلمات و تشریح گرامر انگلیش تودی",
//     "اصطلاحات زبان انگلیسی",
//     "آموزش مکالمه انگلیسی",
//     "بهترین مجموعه های آموزش زبان انگلیسی",
//     "مهارت‌های لیسنسنگ و مکالمه ناخداگاه زبان انگلیسی",
//     "یادگیری زبان انگلیسی از صفر تا صد در منزل",
//     "آموزش زبان انگلیسی با ویدیو فیلم و سریال انگلیش تودی و فرندز و بیگ بنگ تئوری",
//   ],
//   authors: [{ name: "Artak" }],
//   robots: { index: true, follow: true },
//   alternates: { canonical: "/" },
//   openGraph: {
//     locale: "fa_IR",
//     type: "website",
//     url: `${baseUrl}`,
//     siteName: "Artak",
//     title: "آرتاک | آموزش اصولی زبان انگلیسی با ویدیو",
//     description:
//       "اپلیکیشن و وب اپلیکیشن اندروید و آیفون آموزش مکالمه زبان انگلیسی با فیلم و سریال از پایه تا پیشرفته بهمراه ترجمه کلمات و تشریح گرامر با زیرنویس انگلیسی و فارسی همزبان",
//     images: [
//       {
//         url: `${assetUrl}sitefiles/images/sitePreview.png`,
//         width: 1200,
//         height: 630,
//         alt: "وب اپلیکیشن آموزش زبان انگلیسی آرتاک",
//       },
//     ],
//   },
// };

export default function WebappLayout({ children }) {
  return <div>{children}</div>;
}
